Revit 2027 API
ModelCurveArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ModelCurveArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As ModelCurveArrayIterator
public:
virtual ModelCurveArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> ModelCurveArrayIterator
override ReverseIterator : unit -> ModelCurveArrayIterator
Return Value
ModelCurveArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
ModelCurveArray Class
Autodesk.Revit.DB Namespace